Config/Enums/СостоянияДокументовВнутреннегоЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияДокументовВнутреннегоЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытПринудительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяУточнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РаспискаИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РаспискаИнвентаризации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормыОписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыФормОписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОписи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыИнвентаризацииСРаспиской</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолисаОМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРНИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыРегистровУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРегистровУчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКомандыПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ВнутреннийЭДОПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Используются внутренние документы.
// 
// Возвращаемое значение:
//  Булево - Используются внутренние документы
Функция ИспользуютсяВнутренниеДокументы() Экспорт
	Возврат НастройкиВнутреннегоЭДО.ИспользуютсяВнутренниеДокументы();
КонецФункции

// Документ обрабатывается внутренним ЭДОБЭД.
// 
// Параметры:
//  УчетныйДокумент - ДокументСсылка
// 
// Возвращаемое значение:
//  Булево - Документ обрабатывается внутренним ЭДОБЭД
Функция ДокументОбрабатываетсяВнутреннимЭДОБЭД(УчетныйДокумент) Экспорт
	
	Возврат ВнутренниеЭлектронныеДокументыБГУ.ЭтоВнутреннийДокументЭДО(ТипЗнч(УчетныйДокумент))
		И ИнтеграцияЭДО.СостояниеОбъектаУчетаУстановлено(УчетныйДокумент)
		И ВнутренниеЭлектронныеДокументыБГУ.ДокументСодержитВнутреннийЭлектронныйДокументБЭД(УчетныйДокумент);
	
КонецФункции

// Документ обрабатывается ЭДОБЭД.
// 
// Параметры:
//  УчетныйДокумент - ДокументСсылка -
// 
// Возвращаемое значение:
//  Булево - Документ обрабатывается ЭДОБЭД
Функция ДокументОбрабатываетсяЭДОБЭД(УчетныйДокумент) Экспорт
	
	Если Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип.СодержитТип(ТипЗнч(УчетныйДокумент)) Тогда
		Если ВнутренниеЭлектронныеДокументыБГУ.ЭтоВнутреннийДокументЭДО(ТипЗнч(УчетныйДокумент)) Тогда
			Если ИнтеграцияЭДО.СостояниеОбъектаУчетаУстановлено(УчетныйДокумент) Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Типы документов внутреннего ЭДОБЭД.
// 
// Возвращаемое значение:
//  Массив из Тип - Типы документов внутреннего ЭДОБЭД
Функция ТипыДокументовВнутреннегоЭДОБЭД() Экспорт
	
	ТипыДокументов = Новый Массив;
	
	Для Каждого ТипДокумента Из Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип.Типы() Цикл
		Если ВнутренниеЭлектронныеДокументыБГУ.ЭтоВнутреннийДокументЭДО(ТипДокумента) Тогда
			ТипыДокументов.Добавить(ТипДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТипыДокументов;
	
КонецФункции

// Заполнить регистрационные данные организации.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//              - СправочникСсылка.Контрагенты
//  ДанныеОрганизации - Структура
Процедура ЗаполнитьРегистрационныеДанныеОрганизации(Организация, ДанныеОрганизации) Экспорт
	ЭлектронныеДокументыБГУ.ЗаполнитьРегистрационныеДанныеОрганизации(Организация, ДанныеОрганизации);
КонецПроцедуры

// Сведения физ лица пользователя.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  Организация - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Структура - Сведения физ лица пользователя:
// * ИмяПолное - Строка -
// * Должность - Строка -
Функция СведенияФизЛицаПользователя(Пользователь, Организация) Экспорт
	
	Возврат ИнтеграцияЭДО.СведенияФизЛицаПользователя(Пользователь, Организация);
	
КонецФункции

// Заполняет сведения о физическом лице по переданному пользователю и перечню подписываемых объектов
// для заполнения свойств простой электронной подписи по каждому объекту.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь ИБ.
//  Сведения - Структура - данные пользователя:
//   * ПолноеИмя - Строка - полное имя физического лица пользователя, например "Иванов Иван Иванович".
//   * ОрганизацииИДолжности - Соответствие - данные пользователя по подписываемым объектам, где
//      Ключ - ДокументСсылка - подписываемый документ (уже заполнен),
//      Значение - Структура или Массив структур:
//       * Организация - ОпределяемыйТип.Организация - организация пользователя.
//       * Должность - Строка - занимаемая в организации должность.
//       Если вернуть массив структур, то в форме подписания простой ЭП будет доступен выбор пары "Организация - Должность"
//       Не допускается использование разных типов значений для разных элементов соответствия
//
Процедура ЗаполнитьСведенияОПользователе(Знач Пользователь, Сведения) Экспорт
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизическоеЛицо");
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Сведения.ПолноеИмя = Справочники.ФизическиеЛица.ФИОФизлица(ФизическоеЛицо);
	
	ВсеДокументы = Новый Массив;
	Для Каждого Сведение Из Сведения.ОрганизацииИДолжности Цикл
		ВсеДокументы.Добавить(Сведение.Ключ);
	КонецЦикла;
	
	ДатыДокументов = Новый Соответствие;
	ТекущаяДатаСеанса = КонецДня(ТекущаяДатаСеанса());
	Для Каждого ДатаДокумента Из ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВсеДокументы, "ДатаДокумента") Цикл
		Если ЗначениеЗаполнено(ДатаДокумента.Значение) Тогда
			ДатыДокументов.Вставить(КонецДня(ДатаДокумента.Значение), Истина);
		Иначе
			ДатыДокументов.Вставить(ТекущаяДатаСеанса, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ОрганизацииДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВсеДокументы, "Организация");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЮридическоеФизическоеЛицо = &ЮридическоеФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ЮридическоеФизическоеЛицо", ФизическоеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Контрагент = Выборка.Ссылка;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Владелец КАК Организация,
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудники = Новый Массив;
	СотрудникиИОрганизации = Новый Соответствие;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сотрудники.Добавить(Выборка.Ссылка);
		СотрудникиИОрганизации.Вставить(Выборка.Ссылка, Выборка.Организация);
	КонецЦикла;
	
	ОрганизацииИДолжности = Новый Массив;
	
	ТребуемыеДанные = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ДолжностьНаименование");
	
	Для Каждого ДатаДокумента Из ДатыДокументов Цикл
		Для Каждого ДанныеСотрудника Из Справочники.Сотрудники.ПолучитьДанныеСотрудников(
			Сотрудники, ТребуемыеДанные, ДатаДокумента.Ключ) Цикл
			
			Если Не ЗначениеЗаполнено(ДанныеСотрудника.ДолжностьНаименование) Тогда
				Продолжить;
			КонецЕсли;
			
			ОрганизацияИДолжность = Новый Структура;
			ОрганизацияИДолжность.Вставить("Организация", СотрудникиИОрганизации[ДанныеСотрудника.Ссылка]);
			ОрганизацияИДолжность.Вставить("Должность", ДанныеСотрудника.ДолжностьНаименование);
			
			// Исключение наличия дублей в массиве структур
			ЕстьЭлемент = Ложь;
			Для Каждого ИмеющийсяЭлемент Из ОрганизацииИДолжности Цикл
				Если ОрганизацияИДолжность.Организация = ИмеющийсяЭлемент.Организация
					И ОрганизацияИДолжность.Должность = ИмеющийсяЭлемент.Должность Тогда
					ЕстьЭлемент = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ЕстьЭлемент Тогда
				ОрганизацииИДолжности.Добавить(ОрганизацияИДолжность);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Документ Из ВсеДокументы Цикл
		Сведения.ОрганизацииИДолжности.Вставить(Документ, ОбщегоНазначения.СкопироватьРекурсивно(ОрганизацииИДолжности));
		ОрганизацияДокумента = ОрганизацииДокументов[Документ];
		// Если есть несколько организаций и должностей, то первой надо поставить организацию из документа
		Для Индекс = 0 По Сведения.ОрганизацииИДолжности[Документ].ВГраница() Цикл
			ОрганизацияИДолжность = Сведения.ОрганизацииИДолжности[Документ][Индекс];
			Если ОрганизацияИДолжность.Организация = ОрганизацияДокумента Тогда
				Сведения.ОрганизацииИДолжности[Документ].Удалить(Индекс);
				Сведения.ОрганизацииИДолжности[Документ].Вставить(0, ОрганизацияИДолжность);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Вызывается при получении данных актуального табличного документа для сравнения с сохраненным табличным документом
// В процедуре можно дополнить параметр Параметры, который далее будет передан
// в процедуру ВнутреннийЭДО.ДвоичныеДанныеУчетногоДокумента, например, можно сформировать табличный документ в этой
// процедуре и поместить его в Параметры с ключом АдресТабличногоДокумента
// 
// Параметры:
//   Параметры - Структура:
//    * УчетныйДокумент - ОпределяемыйТип.ОснованиеВнутреннегоЭлектронногоДокумента - учетный документ,
//         актуальную печатную форму которого необходимо получить
//    * ИдентификаторКомандыПечати - Строка - идентификатор комадны печати
Процедура ПриПолученииТабличногоДокументаАктуальногоДокумента(Параметры) Экспорт
	
	Если ТипЗнч(Параметры.УчетныйДокумент) = Тип("ДокументСсылка.РегистрУчета") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Параметры.УчетныйДокумент, "ВидРегистра.ВариантОтчета, ПользовательскиеНастройкиОтчета");
		
		Если ЗначениеЗаполнено(РеквизитыДокумента.ВидРегистраВариантОтчета) Тогда
			
			СохраненныеНастройки = РеквизитыДокумента.ПользовательскиеНастройкиОтчета.Получить();
			
			ПараметрыПодключения = Новый Структура;
			ПараметрыПодключения.Вставить("СсылкаВарианта", РеквизитыДокумента.ВидРегистраВариантОтчета);
			Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
				ПараметрыПодключения.Вставить("НастройкиКД", СохраненныеНастройки.Настройки);
				ПараметрыПодключения.Вставить("ПользовательскиеНастройкиКД", СохраненныеНастройки.ПользовательскиеНастройки);
				Попытка
					Подключение = ВариантыОтчетов.СформироватьОтчет(ПараметрыПодключения, Ложь, Ложь);
				Исключение
					ПараметрыПодключения.Удалить("НастройкиКД");
					Подключение = ВариантыОтчетов.СформироватьОтчет(ПараметрыПодключения, Ложь, Ложь);
				КонецПопытки
			Иначе
				ПараметрыПодключения.Вставить("ПользовательскиеНастройкиКД", СохраненныеНастройки);
				Подключение = ВариантыОтчетов.СформироватьОтчет(ПараметрыПодключения, Ложь, Ложь);
			КонецЕсли;
			
			АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(Подключение.ТабличныйДокумент);
			
		Иначе
			АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(Новый ТабличныйДокумент);
		КонецЕсли;
		
		Параметры.Вставить("АдресТабличногоДокумента", АдресТабличногоДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при заполнении формы с настройками внутреннего ЭДО БГУ
// в функции можно заполнить список объектов и их команд печати, которые следует добавить в форму настройки
// 
// Возвращаемое значение:
//  Соответствие
// * Ключ - тип специального объекта печати, например Тип("ДокументСсылка.АвансовыйОтчет")
// * Значение - ТаблицаЗначений - таблица команд печати специального объекта, идентична таблице,
//                                возвращаемой функцией УправлениеПечатью.СоздатьКоллекциюКомандПечати
//                                но содержит меньшее число колонок:
// ** Идентификатор - Строка - идентификатор команды печати
// ** Представление - Строка - представление команды печати
// ** МенеджерПечати - Строка - не заполняется
Функция ОбъектыСоСпециальнымиКомандамиПечати() Экспорт
	
	Объекты = Новый Соответствие;
	
	ТаблицаКоманд = УправлениеПечатью.СоздатьКоллекциюКомандПечати().Скопировать(
		, "Идентификатор, Представление, МенеджерПечати");
	
	Если ПравоДоступа("Чтение", Метаданные.Справочники.ВидыРегистровУчета) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыРегистровУчета.Отчет КАК Отчет,
		|	СУММА(ВЫБОР
		|			КОГДА ВидыРегистровУчета.ВариантОтчета = ЗНАЧЕНИЕ(Справочник.ВариантыОтчетов.ПустаяСсылка)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличестоВариантовОтчетов
		|ПОМЕСТИТЬ ОтчетыИВарианты
		|ИЗ
		|	Справочник.ВидыРегистровУчета КАК ВидыРегистровУчета
		|ГДЕ
		|	НЕ ВидыРегистровУчета.ЭтоГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыРегистровУчета.Отчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ВидыРегистровУчета.ВариантОтчета = ЗНАЧЕНИЕ(Справочник.ВариантыОтчетов.ПустаяСсылка)
		|			ТОГДА ВидыРегистровУчета.Отчет.Имя
		|		ИНАЧЕ ВидыРегистровУчета.ВариантОтчета.КлючВарианта + ВидыРегистровУчета.Отчет.Имя
		|	КОНЕЦ КАК Идентификатор,
		|	ВЫБОР
		|		КОГДА ВидыРегистровУчета.ВариантОтчета = ЗНАЧЕНИЕ(Справочник.ВариантыОтчетов.ПустаяСсылка)
		|			ТОГДА ВидыРегистровУчета.Отчет.Синоним
		|		ИНАЧЕ ВидыРегистровУчета.ВариантОтчета.Наименование
		|	КОНЕЦ КАК Представление
		|ИЗ
		|	Справочник.ВидыРегистровУчета КАК ВидыРегистровУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтчетыИВарианты КАК ОтчетыИВарианты
		|		ПО ВидыРегистровУчета.Отчет = ОтчетыИВарианты.Отчет
		|ГДЕ
		|	НЕ ВидыРегистровУчета.ЭтоГруппа
		|	И НЕ(ОтчетыИВарианты.КоличестоВариантовОтчетов > 0
		|				И ВидыРегистровУчета.ВариантОтчета = ЗНАЧЕНИЕ(Справочник.ВариантыОтчетов.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Представление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяКоманда = ТаблицаКоманд.Добавить();
			НоваяКоманда.Идентификатор = Лев(Выборка.Идентификатор, 100);
			НоваяКоманда.Представление = Выборка.Представление;
		КонецЦикла;
	КонецЕсли;
	
	Объекты.Вставить(Тип("ДокументСсылка.РегистрУчета"), ТаблицаКоманд);
	
	Возврат Объекты;
	
КонецФункции

// Вызывается перед открытием формы нового внутреннего электронного документа
// Позволяет изменить параметры открытия для передачи в процедуру ВнутреннийЭДОКлиент.ОткрытьФормуЭлектронногоДокумента
// 
// Параметры:
//   ПараметрыДокумента - Структура - см. функцию ВнутреннийЭДОКлиентСервер.ПараметрыОткрытияЭлектронногоДокумента()
Процедура ПриЗаполненииПараметровНовогоЭлектронногоДокумента(ПараметрыДокумента) Экспорт
	
	Если ТипЗнч(ПараметрыДокумента.УчетныйДокумент) = Тип("ДокументСсылка.РегистрУчета") Тогда
		
		ДанныеРегистра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ПараметрыДокумента.УчетныйДокумент,
			"ВидРегистра.ВариантОтчета.КлючВарианта, ВидРегистра.Отчет.Имя,
			|ВидРегистра.Отчет.Синоним, ВидРегистра.Наименование, РегистрMXL, Описание");
		
		Если Не ЗначениеЗаполнено(ДанныеРегистра.РегистрMXL) Тогда
			ОписаниеОшибки = НСтр("ru = 'В регистре учета отсутствует mxl-файл. Необходимо создать новый регистр учета.'");
			ПараметрыДокумента.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ДанныеРегистра.РегистрMXL, Ложь);
		ТабличныйДокументОсновной = ВнутреннийЭДО.ТабличныйДокументИзДвоичныхДанныхФайла(ДвоичныеДанные);
		АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной);
		
		ПараметрыДокумента.ИдентификаторКомандыПечати = Лев(
			Строка(ДанныеРегистра.ВидРегистраВариантОтчетаКлючВарианта) + ДанныеРегистра.ВидРегистраОтчетИмя, 100);
		Если ЗначениеЗаполнено(ДанныеРегистра.ВидРегистраВариантОтчетаКлючВарианта) Тогда
			ПараметрыДокумента.ВидДокумента = ДанныеРегистра.ВидРегистраНаименование;
		Иначе
			ПараметрыДокумента.ВидДокумента = ДанныеРегистра.ВидРегистраОтчетСиноним;
		КонецЕсли;
		ПараметрыДокумента.АдресТабличногоДокумента = АдресТабличногоДокумента;
		ПараметрыДокумента.ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(
			ДанныеРегистра.Описание);
		Если СтрДлина(ПараметрыДокумента.ИмяФайла) > 150 Тогда
			ПараметрыДокумента.ИмяФайла = ВнутреннийЭДОВызовСервера.СокращенноеИмяФайла(ПараметрыДокумента.ИмяФайла, 150);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при проверке, подходит ли команда печати для формирования электронного документа
// При возврате Неопределено будет выпонена стандартная проверка
// 
// Параметры:
//   КомандаПечати - СтрокаТаблицыЗначений - см. УправлениеПечатью.КомандыПечатиОбъекта
//   УчетныйДокумент - ОпределяемыйТип.ОснованиеВнутреннегоЭлектронногоДокумента - учетный документ
// 
// Возвращаемое значение:
//   Истина - команда подходит
//   Ложь - команда не подходит
//   Неопределено - будет выполнена стандартная проверка
Функция КомандаПечатиПодходитПоУсловиям(КомандаПечати, УчетныйДокумент) Экспорт
	
	Результат = Неопределено;
	
	Если ТипЗнч(УчетныйДокумент) = Тип("ДокументСсылка.РегистрУчета") Тогда
		
		ДанныеРегистра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетныйДокумент,
			"ВидРегистра.ВариантОтчета.КлючВарианта, ВидРегистра.Отчет.Имя");
		
		ИдентификаторКомандыПечати = Лев(
			Строка(ДанныеРегистра.ВидРегистраВариантОтчетаКлючВарианта) + ДанныеРегистра.ВидРегистраОтчетИмя, 100);
		
		Результат = ИдентификаторКомандыПечати = КомандаПечати.Идентификатор;
		
	ИначеЕсли ТипЗнч(УчетныйДокумент) = Тип("СправочникСсылка.ВидыРегистровУчета") Тогда
		
		ДанныеРегистра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетныйДокумент,
			"ВариантОтчета.КлючВарианта, Отчет.Имя");
		
		ИдентификаторКомандыПечати = Лев(
			Строка(ДанныеРегистра.ВариантОтчетаКлючВарианта) + ДанныеРегистра.ОтчетИмя, 100);
		
		Результат = ИдентификаторКомандыПечати = КомандаПечати.Идентификатор;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вызывается при открытии формы списка электронных документов
// Процедура позволяет установить значения даты, номера и организации, используемых для последующего создания ЭД
// 
// Параметры:
//   УчетныйДокумент - ОпределяемыйТип.ОснованиеВнутреннегоЭлектронногоДокумента - учетный документ
//   РеквизитыУчетногоДокумента - Структура - параметры для последующего заполнения электронного документа:
//    * Номер - Строка
//    * Дата - Дата
//    * Организация - ОпределяемыйТип.Организация
//   СтандартнаяОбработка - Булево - Если Ложь, то не будет выполнено стандартное получение реквизитов
Процедура ПриЗаполненииРеквизитовУчетногоДокумента(УчетныйДокумент, РеквизитыУчетногоДокумента, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(УчетныйДокумент) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетныйДокумент, "Организация");
		РеквизитыУчетногоДокумента.Организация = Организация;
		
	ИначеЕсли ТипЗнч(УчетныйДокумент) = Тип("СправочникСсылка.КарточкиКапвложений") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетныйДокумент, "Владелец");
		РеквизитыУчетногоДокумента.Организация = Организация;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при чтении на сервере формы учетного документа
// Процедура позволяет переопределить стандартное получение ссылки на организацию
// 
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма учетного документа
//   Источник - ДокументОбъект - учетный документ
//   Организация - ОпределяемыйТип.Организация - в этот параметр можно поместить ссылку на организации
//   СтандартнаяОбработка - Булево - Если Истина,
//      то будет выполнено стандартное получение организации через Источник.Организация
Процедура ПриПолученииОрганизацииПоОбъекту(Форма, Источник, Организация, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.КарточкиКапвложений") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Организация = Источник.Владелец;
		
	КонецЕсли;
	
КонецПроцедуры

// В процедуре можно описать идентификаторы печатных форм, которые не могут использоваться для внутреннего ЭДО
// 
// Параметры:
//   ПечатныеФормы - Соответствие
//     в качестве ключей указываются строковые идентификаторы команд печати, а в качестве значений - Истина,
//     например: ПечатныеФормы.Вставить("Форма0504086_стр1_103н", Истина);
Процедура ДобавитьПечатныеФормыИсключения(ПечатныеФормы) Экспорт
	
	ИдентификаторПередачаОбъектовИК = "ПечатьИнвКарточек"
									+ ",Документ.ПринятиеКУчетуОбъектовОС.АктПриемаПередачи0504101_103н"
									+ ",Документ.ПринятиеКУчетуОбъектовОС.АктПриемаПередачи0504101_103н";
	ПечатныеФормы.Вставить(ИдентификаторПередачаОбъектовИК, Истина);
	ИдентификаторПередачаОбъектовИК = "ПечатьИнвКарточек"
									+ ",Документ.ПринятиеКУчетуОбъектовОС.АктПриемаПередачи0504101"
									+ ",Документ.ПринятиеКУчетуОбъектовОС.АктПриемаПередачи0504101";
	ПечатныеФормы.Вставить(ИдентификаторПередачаОбъектовИК, Истина);
	
	ИдентификаторИнвентаризацияКассы = "Форма0504086_стр1_103н,Форма0504086_стр2_103н";
	ПечатныеФормы.Вставить(ИдентификаторИнвентаризацияКассы, Истина);
	ИдентификаторИнвентаризацияКассы = "Форма0504086_стр1,Форма0504086_стр2";
	ПечатныеФормы.Вставить(ИдентификаторИнвентаризацияКассы, Истина);
	ИдентификаторИнвентаризацияКассы = "Форма0504086_стр1_103н,Форма0504086_стр2_ФактНаличие_103н";
	ПечатныеФормы.Вставить(ИдентификаторИнвентаризацияКассы, Истина);
	ИдентификаторИнвентаризацияКассы = "Форма0504086_стр1,Форма0504086_стр2_ФактНаличие";
	ПечатныеФормы.Вставить(ИдентификаторИнвентаризацияКассы, Истина);
	
	ИдентификаторИнвКарточек = "ПечатьИнвКарточек";
	ПечатныеФормы.Вставить(ИдентификаторИнвКарточек, Истина); 
	
	ПечатьТТН_1208 = "ПечатьТТН_1208";
	ПечатныеФормы.Вставить(ПечатьТТН_1208, Истина);
	
КонецПроцедуры

// Вызывается при выборе маршрута подписания в форме и при записи нового внутреннего электронного документа
// Позволяет выполнить неблокирующие проверки состава маршрута подписания для новых документов
// 
// Параметры:
//   УчетныйДокумент - ОпределяемыйТип.ОснованиеВнутреннегоЭлектронногоДокумента - учетный документ
//   СоставМаршрута - ТаблицаЗначений - см. процедуру ВнутреннийЭДО.СоставМаршрутаПодписания()
//   ВнутреннийДокумент - ДокументОбъект.ВнутреннийЭлектронныйДокумент - записываемый документ (при вызове из события ПередЗаписью)
//                      - ДанныеФормыСтруктура - основной реквизит формы внутреннего ЭД (при вызове из формы объекта)
Процедура ПроверитьСоставМаршрутаНовогоДокумента(УчетныйДокумент, СоставМаршрута, ВнутреннийДокумент = "") Экспорт
	
	// Проверка наличия в маршруте отсутствующих членов комиссии
	Если Метаданные.ОпределяемыеТипы.ДокументыСГолосованиемКомиссии.Тип.СодержитТип(ТипЗнч(УчетныйДокумент)) Тогда
		
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(УчетныйДокумент);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СоставКомиссии.Сотрудник КАК Сотрудник,
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	" + ИмяТаблицы + ".СоставКомиссии КАК СоставКомиссии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО СоставКомиссии.Сотрудник.Контрагент.ЮридическоеФизическоеЛицо = Пользователи.ФизическоеЛицо
		|ГДЕ
		|	СоставКомиссии.Ссылка = &Ссылка
		|	И СоставКомиссии.Отсутствует";
		
		Запрос.УстановитьПараметр("Ссылка", УчетныйДокумент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОтсутствующиеПользователи = Новый Соответствие;
		
		Пока Выборка.Следующий() Цикл
			ОтсутствующиеПользователи.Вставить(Выборка.Пользователь, Выборка.Сотрудник);
		КонецЦикла;
		
		Для Каждого СтрокаМаршрута Из СоставМаршрута Цикл
			Сотрудник = ОтсутствующиеПользователи[СтрокаМаршрута.Подписант];
			Если Сотрудник <> Неопределено Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Член комиссии %1 отмечен, как отсутствующий, но он указан в маршруте подписания документа %2. Возможно, маршрут подписания выбран некорректно.'"),
				Сотрудник, ВнутреннийДокумент);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ТипУчетногоДокумента = ТипЗнч(УчетныйДокумент);
	ИдентификаторКомандыПечати = ВнутреннийДокумент.ИдентификаторКомандыПечати;
	
	Если (ИдентификаторКомандыПечати = "АктПриемаПередачи0510448"
			ИЛИ ИдентификаторКомандыПечати = "АктПриемаПередачи0510448ПоСебестоимости")
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ПередачаОбъектовИК")
			ИЛИ ТипУчетногоДокумента = Тип("ДокументСсылка.ПередачаОбъектовОС")
			ИЛИ ТипУчетногоДокумента = Тип("ДокументСсылка.НакладнаяНаОтпускИК")
			ИЛИ ТипУчетногоДокумента = Тип("ДокументСсылка.НакладнаяНаОтпускМ15")) Тогда
		
		ПроверяемыеРеквизиты = Новый Массив;
		ПроверяемыеРеквизиты.Добавить("ЦМО");
		ПроверяемыеРеквизиты.Добавить("Руководитель");
		ПроверяемыеРеквизиты.Добавить("ОтветственныйИсполнитель");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетныйДокумент, ПроверяемыеРеквизиты);
		Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
			Если Не ЗначениеЗаполнено(ЗначенияРеквизитов[ПроверяемыйРеквизит]) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В документе %1 не заполнен реквизит %2'"),
				УчетныйДокумент, ПроверяемыйРеквизит);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, УчетныйДокумент, ПроверяемыйРеквизит);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ИдентификаторКомандыПечати = "ОтветныйАктПриемаПередачи0510448"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ПоступлениеИК")
			ИЛИ ТипУчетногоДокумента = Тип("ДокументСсылка.ПоступлениеМЗ")
			ИЛИ ТипУчетногоДокумента = Тип("ДокументСсылка.ПоступлениеОС")
			ИЛИ ТипУчетногоДокумента = Тип("ДокументСсылка.ПоступлениеОСИК")
			ИЛИ ТипУчетногоДокумента = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовИК")
			ИЛИ ТипУчетногоДокумента = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовОС")) Тогда
		
		ПроверяемыеРеквизиты = Новый Массив;
		ПроверяемыеРеквизиты.Добавить("ЦМО");
		ПроверяемыеРеквизиты.Добавить("Руководитель");
		ПроверяемыеРеквизиты.Добавить("ОтветственныйИсполнитель");
		ПроверяемыеРеквизиты.Добавить("Комиссия");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеИК.ЦМО КАК ЦМО,
		|	ПоступлениеИК.Руководитель КАК Руководитель,
		|	ПоступлениеИК.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
		|	ПоступлениеИК.Комиссия КАК Комиссия,
		|	ПоступлениеИК.СоставКомиссии.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Сотрудник КАК Сотрудник
		|	) КАК СоставКомиссии
		|ИЗ
		|	Документ.ПоступлениеИК КАК ПоступлениеИК
		|ГДЕ
		|	ПоступлениеИК.Ссылка = &Ссылка
		|	И ПоступлениеИК.НФАПереданыЭлектроннымАктом";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПоступлениеИК", УчетныйДокумент.Метаданные().Имя);
		
		Запрос.УстановитьПараметр("Ссылка", УчетныйДокумент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
				Если Не ЗначениеЗаполнено(Выборка[ПроверяемыйРеквизит]) Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В документе %1 не заполнен реквизит %2'"),
					УчетныйДокумент, ПроверяемыйРеквизит);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, УчетныйДокумент, ПроверяемыйРеквизит);
				КонецЕсли;
			КонецЦикла;
			ВыборкаСоставКомиссии = Выборка.СоставКомиссии.Выбрать();
			Если ВыборкаСоставКомиссии.Количество() = 0 Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В документе %1 не заполнен состав комиссии'"),
				УчетныйДокумент);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, УчетныйДокумент);
			КонецЕсли;
			Пока ВыборкаСоставКомиссии.Следующий() Цикл
				Если Не ЗначениеЗаполнено(ВыборкаСоставКомиссии.Сотрудник) Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В документе %1 в составе комиссии не заполнен сотрудник в строке %2'"),
					УчетныйДокумент, ВыборкаСоставКомиссии.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, УчетныйДокумент);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при записи нового внутреннего электронного документа
// Позволяет выполнить блокирующие проверки для новых внутренних документов
// 
// Параметры:
//   УчетныйДокумент - ОпределяемыйТип.ОснованиеВнутреннегоЭлектронногоДокумента - учетный документ
//   СоставМаршрута - ТаблицаЗначений - см. процедуру ВнутреннийЭДО.СоставМаршрутаПодписания()
//   ВнутреннийДокумент - ДокументОбъект.ВнутреннийЭлектронныйДокумент - записываемый документ (при вызове из события ПередЗаписью)
//                      - ДанныеФормыСтруктура - основной реквизит формы внутреннего ЭД (при вызове из формы объекта)
Функция НовыйВнутреннийДокументНеПризнанКорректнымДляЗаписи(УчетныйДокумент, СоставМаршрута, ВнутреннийДокумент = "") Экспорт
	Результат = Ложь;

	ТипУчетногоДокумента = ТипЗнч(УчетныйДокумент);
	ИдентификаторКомандыПечати = ВнутреннийДокумент.ИдентификаторКомандыПечати;
	
	//Инвентаризационные описи
	ПроверкаРасписки = Ложь;
	Если ИдентификаторКомандыПечати = "Форма0510465"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьБСО")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	Если ИдентификаторКомандыПечати = "Форма0510467"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьНаличныхСредств")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	Если ИдентификаторКомандыПечати = "Форма0510466"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	Если ИдентификаторКомандыПечати = "Форма0510464"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьОстатковНаСчетах")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	Если ИдентификаторКомандыПечати = "Форма0510468"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьРасчетовПоПоступлениям")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	Если ИдентификаторКомандыПечати = "Форма0510470"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьЦенныхБумаг")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	Если ИдентификаторКомандыПечати = "Форма0510472"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьГосДолгаВЦенныхБумагах")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	Если ИдентификаторКомандыПечати = "Форма0510473"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьГосДолгаПоПривлеченнымКредитам")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	Если ИдентификаторКомандыПечати = "Форма0510474"
		И (ТипУчетногоДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьГосДолгаПоПредоставленнымГарантиям")) Тогда
		ПроверкаРасписки = Истина;
	КонецЕсли;
	
	Если ПроверкаРасписки Тогда
		ЕстьДокументРасписки = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	РаспискаИнвентаризации.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.РаспискаИнвентаризации КАК РаспискаИнвентаризации
		               |ГДЕ
		               |	РаспискаИнвентаризации.ДокументОписи = &ДокументОписи
		               |	И РаспискаИнвентаризации.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Ссылка УБЫВ";
		Запрос.УстановитьПараметр("ДокументОписи", УчетныйДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДокументРасписки = Выборка.Ссылка;
			ЕстьДокументРасписки = Истина;
		    ВнутреннийЭД = ВнутренниеЭлектронныеДокументыБГУ.ВнутреннийЭДРаспискиИнвентаризации(ДокументРасписки);
			Если ЗначениеЗаполнено(ВнутреннийЭД) Тогда
				СостояниеЭлектронногоДокумента = ВнутреннийЭДО.СостояниеЭлектронногоДокумента(ВнутреннийЭД);
				
				Если НЕ СостояниеЭлектронногоДокумента.Состояние = Перечисления.СостоянияДокументовВнутреннегоЭДО.Завершен Тогда
					Результат = Истина;
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для документа %2 документа %1 не подписан внутренний электронный документ.'"),
					УчетныйДокумент, ДокументРасписки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, УчетныйДокумент);
				КонецЕсли;
			Иначе
				Результат = Истина;
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %2 документа %1 не создан внутренний электронный документ.'"),
				УчетныйДокумент, ДокументРасписки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, УчетныйДокумент);
			КонецЕсли;	
		КонецЦикла;
		Если НЕ ЕстьДокументРасписки Тогда
			Результат = Истина;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Нет документа расписки для документа %1.'"),
			УчетныйДокумент);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, УчетныйДокумент);
		КонецЕсли;	
	КонецЕсли;	

	Возврат Результат;
КонецФункции

// Вызывается при создании на сервере формы списка внутренних электронных документов
// 
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма списка внутренних электронных документов
Процедура ПриСозданииФормыСпискаВнутреннихЭлектронныхДокументов(Форма) Экспорт
	
	ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(Форма);
	
КонецПроцедуры

// Вызывается при создании на сервере формы списка настроек ЭДО
// 
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма списка настроек ЭДО
Процедура ПриСозданииФормыСпискаНастроекЭДО(Форма) Экспорт
	
	ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(Форма);
	
КонецПроцедуры

// Вызывается в событии "ОбработкаПолученияФормы" регистра сведений "НастройкиВнутреннегоЭДОБГУ"
// 
// Параметры:
//   см. описание события ОбработкаПолученияФормы
Процедура ОбработкаПолученияФормыСпискаНастроек(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается в событии "ОбработкаЗаполнения" документа "ВнутреннийЭлектронныйДокумент"
// 
// Параметры:
//   см. описание события ОбработкаЗаполнения
Процедура ВнутреннийЭлектронныйДокументОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Заполняет таблицу команд печати для исключения из сценариев внутреннего ЭДО
//
// Параметры:
//  ТаблицаИсключений  - ТаблицаЗначений - таблица команд для исключения из внутреннего ЭДО
//                ** УчетныйДокумент    - ДокументСсылка - документ для которого применяется исключение.
//                ** ИдентификаторКомандыПечати - Строка - идентификатор команды.
//                ** ПричинаИсключенияКомандыПечати - Строка - текстовое сообщение для пользователя о причинах исключения из внутреннего ЭДО.
Процедура ПриЗаполненииТаблицыИсключенийКомандПечатиЭДО(ТаблицаИсключений) Экспорт

	 ВнутренниеЭлектронныеДокументыБГУ.ПриЗаполненииТаблицыИсключенийКомандПечатиЭДО(ТаблицаИсключений);

КонецПроцедуры

Процедура ЗаполнитьНастройкуОтображатьДатуПодписанияПоОрганизации(Организация = Неопределено, ОтображатьДатуПодписанияПоОрганизации) Экспорт
	
	ОтображатьДатуПодписанияПоОрганизации = ЭлектронныеДокументыБГУ.ОтображатьДатуПодписанияПоОрганизации(Организация);
	
КонецПроцедуры

Процедура ЗаполнитьРежимПоддержкиИнтеграцииСБЭД(ЕстьОбменЧерезБЭД) Экспорт

	ЕстьОбменЧерезБЭД = Истина;	

КонецПроцедуры

Процедура ЗаполнитьВсеВнешниеПроизвольныеЭлектронныеДокументыУчетногоДокумента(ВнутреннийЭД, ПроизвольныеЭД) Экспорт
	
	ПроизвольныеЭД = ЭлектронныеДокументыБГУ.ВсеВнешниеПроизвольныеЭлектронныеДокументыВнутреннегоДокумента(ВнутреннийЭД);
	
КонецПроцедуры

Процедура ЗаполнитьВидимостьЭлементовВнешнегоЭДО(Контрагент, Организация, ВидимостьЭлементовВнешнегоЭДО) Экспорт

	ВидимостьЭлементовВнешнегоЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Контрагент, Организация);		
	
КонецПроцедуры

Процедура ЗаполнитьЭлектронныеПодписиВнешнегоЭДСвязанногоСВнутреннимЭД(ВнутреннийЭД, Результат) Экспорт

	Результат = ЭлектронныеДокументыБГУ.ЭлектронныеПодписиВнешнегоЭДСвязанногоСВнутреннимЭД(ВнутреннийЭД);
	
КонецПроцедуры

Процедура ДобавитьШтампыЭлектронныхПодписейВнешнегоЭД(ТабличныйДокументЭД, ЭлектронныеПодписиВнешнегоЭД, Организация, ВыводитьДатуПодписи = Истина) Экспорт

	ЭлектронныеДокументыБГУ.ДобавитьШтампыЭлектронныхПодписейВнешнегоЭД(ТабличныйДокументЭД, 
		ЭлектронныеПодписиВнешнегоЭД, Организация, ВыводитьДатуПодписи);
	
КонецПроцедуры

Процедура ВнешнийЭлектронныйДокументФайла(ВнутреннийЭД, ПараметрыФормы) Экспорт

	ЭлектронныеДокументыБГУ.ВнешнийЭлектронныйДокументФайла(ВнутреннийЭД, ПараметрыФормы);
	
КонецПроцедуры

Процедура КопияФормуляраВнешнийЭлектронныйДокументФайла(ВнутреннийЭД, ПараметрыФормы) Экспорт
	
	ЭлектронныеДокументыБГУ.КопияФормуляраВнешнийЭлектронныйДокументФайла(ВнутреннийЭД, ПараметрыФормы);
	
КонецПроцедуры

// Возможность проведения документов не датой документа
// 
// Возвращаемое значение:
//  Булево
//
Функция ИспользоватьОтдельнуюДатуПроведенияДокументов() Экспорт
	Возврат Константы.ИспользоватьОтдельнуюДатуПроведенияДокументов.Получить();
КонецФункции

// Признак блокирования создания внутреннего электронного документа, если он некорректый.
// Корректность проверяется в функции НовыйВнутреннийДокументНеПризнанКорректнымДляЗаписи
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Булево
//
Функция НеБлокироватьСозданиеВнутреннихЭДДляНекорректныхДокументовУчета(Организация) Экспорт
	Возврат ВнутренниеЭлектронныеДокументыБГУ.НеБлокироватьСозданиеВнутреннихЭДДляНекорректныхДокументовУчета(Организация);
КонецФункции

// Возвращает представление команды печати объекта.
//
// Параметры:
//  ИдентификаторОбъекта - СправочникСсылка.ИдентификаторыОбъектовМетаданных - идентификатор объекта метаданных.
//  ИдентификаторКоманды - Строка - идентификатор команды печати.
//
// Возвращаемое значение:
//  Строка - представление команды печати.
//
Функция ПредставлениеКомандыПечатиОбъекта(ИдентификаторДокумента, ИдентификаторКомандыПечати) Экспорт
	Возврат ИнтерфейсДокументовЭДО.ПредставлениеКомандыПечатиОбъекта(ИдентификаторДокумента, ИдентификаторКомандыПечати);
КонецФункции

#КонецОбласти
